= Test Results

[.lead]
16/07/2025 19:14

[#test-example]
== pass:[<i class="bi bi-check-square text-success"></i>] Example

[source,asciidoc]
----
== Unnumbered Section

====
This is a simple example.
====

----


== Unnumbered Section

====
This is a simple example.
====



[#test-example-in-numbered-section]
== pass:[<i class="bi bi-check-square text-success"></i>] Example in numbered section

[source,asciidoc]
----
:sectnums:
== Numbered Section

== Other Numbered Section

====
This is a simple example.
====

:!sectnums:

----


:sectnums:
== Numbered Section

== Other Numbered Section

====
This is a simple example.
====

:!sectnums:



[#test-theorem]
== pass:[<i class="bi bi-check-square text-success"></i>] Theorem

[source,asciidoc]
----
[theorem]
====
This is a theorem.
====

----


[theorem]
====
This is a theorem.
====



[#test-theorem-in-chapter]
== pass:[<i class="bi bi-check-square text-success"></i>] Theorem in chapter

[source,asciidoc]
----
:chapnum: 2

[theorem]
====
This is a theorem numbered within chapter 2.
====

----


:chapnum: 2

[theorem]
====
This is a theorem numbered within chapter 2.
====



[#test-theorem-with-title]
== pass:[<i class="bi bi-check-square text-success"></i>] Theorem with title

[source,asciidoc]
----
.Theorem Title
[theorem]
====
This is a theorem with title.
====

----


.Theorem Title
[theorem]
====
This is a theorem with title.
====



[#test-figure]
== pass:[<i class="bi bi-check-square text-success"></i>] Figure

[source,asciidoc]
----
.Picture of a cute cat.
image::cat1.jpg[cute cat]

----


.Picture of a cute cat.
image::cat1.jpg[cute cat]



[#test-ordered-list]
== pass:[<i class="bi bi-check-square text-success"></i>] Ordered list

[source,asciidoc]
----
[[olist-id]]
. First item, level 1
. Second item, level 1
.. First item, level 2
... First item, level 3
... Second item, level 3
.... First item, level 4
... Third item, level 3
.. Second item, level 2
. Third item, level 1

----


[[olist-id]]
. First item, level 1
. Second item, level 1
.. First item, level 2
... First item, level 3
... Second item, level 3
.... First item, level 4
... Third item, level 3
.. Second item, level 2
. Third item, level 1



[#test-ordered-list-of-figures]
== pass:[<i class="bi bi-check-square text-success"></i>] Ordered list of figures

[source,asciidoc]
----
[figlist]
.Two beautiful cats.
. image:cat2.jpg[Cat in basket,title=A cat in a basket.]
. image:cat3.jpg[Cat on sofa,title=A cat on a sofa.]

----


[figlist]
.Two beautiful cats.
. image:cat2.jpg[Cat in basket,title=A cat in a basket.]
. image:cat3.jpg[Cat on sofa,title=A cat on a sofa.]



[#test-ordered-list-with-start]
== pass:[<i class="bi bi-check-square text-success"></i>] Ordered list with start

[source,asciidoc]
----
[start=3]
. First item, level 1
. Second item, level 1
.. First item, level 2
... First item, level 3
... Second item, level 3
.... First item, level 4
... Third item, level 3
.. Second item, level 2
. Third item, level 1

----


[start=3]
. First item, level 1
. Second item, level 1
.. First item, level 2
... First item, level 3
... Second item, level 3
.... First item, level 4
... Third item, level 3
.. Second item, level 2
. Third item, level 1



[#test-ordered-list-with-title]
== pass:[<i class="bi bi-check-square text-success"></i>] Ordered list with title

[source,asciidoc]
----
.List Title
[[olist-title-id]]
. First item
. Second item
. Third item

----


.List Title
[[olist-title-id]]
. First item
. Second item
. Third item



[#test-pseudocode]
== pass:[<i class="bi bi-check-square text-success"></i>] Pseudocode

[source,asciidoc]
----
[pseudocode]
. First item, level 1
. Second item, level 1
.. First item, level 2
... First item, level 3
... Second item, level 3
.... First item, level 4
... Third item, level 3
.. Second item, level 2
. Third item, level 1

----


[pseudocode]
. First item, level 1
. Second item, level 1
.. First item, level 2
... First item, level 3
... Second item, level 3
.... First item, level 4
... Third item, level 3
.. Second item, level 2
. Third item, level 1



[#test-pseudocode-with-start]
== pass:[<i class="bi bi-check-square text-success"></i>] Pseudocode with start

[source,asciidoc]
----
[pseudocode,start=5]
. First item, level 1
. Second item, level 1
.. First item, level 2
... First item, level 3
... Second item, level 3
.... First item, level 4
... Third item, level 3
.. Second item, level 2
. Third item, level 1

----


[pseudocode,start=5]
. First item, level 1
. Second item, level 1
.. First item, level 2
... First item, level 3
... Second item, level 3
.... First item, level 4
... Third item, level 3
.. Second item, level 2
. Third item, level 1



[#test-paragraph]
== pass:[<i class="bi bi-check-square text-success"></i>] Paragraph

[source,asciidoc]
----
This is a simple paragraph.

----


This is a simple paragraph.



[#test-paragraph-with-title]
== pass:[<i class="bi bi-check-square text-success"></i>] Paragraph with title

[source,asciidoc]
----
.Paragraph Title
This is a paragraph with title.

----


.Paragraph Title
This is a paragraph with title.



[#test-numbered-section]
== pass:[<i class="bi bi-check-square text-success"></i>] Numbered section

[source,asciidoc]
----
:sectnums:
:xrefstyle: short

[[numbered-sec-id]]
== Section Title

This is some content for <<numbered-sec-id>>.

====
This is an example.
====

[lemma#lem-minor-2]
.Minor Lemma
====
This is a lemma.
====

Building on <<lem-minor-2>>:

[proposition]
====
This is a proposition.
====

:!sectnums:
----


:sectnums:
:xrefstyle: short

[[numbered-sec-id]]
== Section Title

This is some content for <<numbered-sec-id>>.

====
This is an example.
====

[lemma#lem-minor-2]
.Minor Lemma
====
This is a lemma.
====

Building on <<lem-minor-2>>:

[proposition]
====
This is a proposition.
====

:!sectnums:


[#test-section]
== pass:[<i class="bi bi-check-square text-success"></i>] Section

[source,asciidoc]
----
[[sec-id]]
== Section Title

This is some content for <<sec-id>>.

====
This is an example.
====

[lemma#lem-minor]
====
This is a lemma.
====

Building on <<lem-minor>>:

[proposition]
====
This is a proposition.
====

The following describes an <<alg-easy>>.
The main work is done inside step <<alg-easy-loop-body>>,
not <<alg-easy-condition-statement>>.
The algorithm terminates on the <<alg-easy-output-line>>.

[algorithm]
====
Here is an algorithm.

[[alg-easy]]
.Easy Algorithm
. Initialise variables.
. For every item in loop:
.. [[alg-easy-loop-body]]Do some stuff.
.. If some condition:
... [[alg-easy-condition-statement]]Some statement.
. [[alg-easy-output-line,output line]]Output something.
====

Take a break and look at <<fig-cats>>, paying special
attention to <<fig-sofa-cat>>.

[figlist#fig-cats]
.Two beautiful cats.
. image:cat2.jpg[Cat in basket,title=A cat in a basket.]
. [[fig-sofa-cat]]image:cat3.jpg[Cat on sofa,title=A cat on a sofa.]

[theorem#thm-important]
.An Important Theorem
====
This is a theorem with title.
====

[corollary]
====
This is a corollary to <<thm-important>>.
====

----


[[sec-id]]
== Section Title

This is some content for <<sec-id>>.

====
This is an example.
====

[lemma#lem-minor]
====
This is a lemma.
====

Building on <<lem-minor>>:

[proposition]
====
This is a proposition.
====

The following describes an <<alg-easy>>.
The main work is done inside step <<alg-easy-loop-body>>,
not <<alg-easy-condition-statement>>.
The algorithm terminates on the <<alg-easy-output-line>>.

[algorithm]
====
Here is an algorithm.

[[alg-easy]]
.Easy Algorithm
. Initialise variables.
. For every item in loop:
.. [[alg-easy-loop-body]]Do some stuff.
.. If some condition:
... [[alg-easy-condition-statement]]Some statement.
. [[alg-easy-output-line,output line]]Output something.
====

Take a break and look at <<fig-cats>>, paying special
attention to <<fig-sofa-cat>>.

[figlist#fig-cats]
.Two beautiful cats.
. image:cat2.jpg[Cat in basket,title=A cat in a basket.]
. [[fig-sofa-cat]]image:cat3.jpg[Cat on sofa,title=A cat on a sofa.]

[theorem#thm-important]
.An Important Theorem
====
This is a theorem with title.
====

[corollary]
====
This is a corollary to <<thm-important>>.
====



[#test-section-in-chapter]
== pass:[<i class="bi bi-check-square text-success"></i>] Section in chapter

[source,asciidoc]
----
:chapnum: 3

[[sec-in-chap-id]]
== Section Title

This is some content for <<sec-in-chap-id>>.

====
This is an example.
====

[lemma#lem-minor-3]
.Minor Lemma
====
This is a lemma.
====

Building on <<lem-minor-3>>:

[proposition]
====
This is a proposition.
====
 
See <<fig-cute-cat>> for a picture of a cute cat.

[[fig-cute-cat]]
.Picture of a cute cat.
image::cat2.jpg[cute cat]

Now for something more serious. Pay special attention
to line <<alg-serious-line>> of <<alg-serious>> which starts
with an <<alg-serious-init>>.

[algorithm#alg-serious]
.A Serious Algorithm
====
[pseudocode]
. [[alg-serious-init,initialisation line]]First item, level 1
. Second item, level 1
.. First item, level 2
... First item, level 3
... Second item, level 3
.... [[alg-serious-line]]First item, level 4
... Third item, level 3
.. Second item, level 2
. Third item, level 1
====

----


:chapnum: 3

[[sec-in-chap-id]]
== Section Title

This is some content for <<sec-in-chap-id>>.

====
This is an example.
====

[lemma#lem-minor-3]
.Minor Lemma
====
This is a lemma.
====

Building on <<lem-minor-3>>:

[proposition]
====
This is a proposition.
====
 
See <<fig-cute-cat>> for a picture of a cute cat.

[[fig-cute-cat]]
.Picture of a cute cat.
image::cat2.jpg[cute cat]

Now for something more serious. Pay special attention
to line <<alg-serious-line>> of <<alg-serious>> which starts
with an <<alg-serious-init>>.

[algorithm#alg-serious]
.A Serious Algorithm
====
[pseudocode]
. [[alg-serious-init,initialisation line]]First item, level 1
. Second item, level 1
.. First item, level 2
... First item, level 3
... Second item, level 3
.... [[alg-serious-line]]First item, level 4
... Third item, level 3
.. Second item, level 2
. Third item, level 1
====


